"""
在python中，协程是异步编程最核心的技术。
本质是轻量级的用户态线程，协程的调度完全由程序自身控制，而不是由操作系统内核调度。
协程的出现是为了解决异步编程中回调地狱的问题，使得异步代码可以像同步代码一样书写。
但协程需要手动调度，在cpu密集型任务中，协程无法利用多核cpu的优势，因为它们运行在单线程中。
在python中，协程是3.5版本引入的async/await语法实现的，async定义一个协程函数，await用于挂起协程函数的执行，等待异步操作完成后再继续执行。
    - asyncio是python标准库中提供的异步编程框架，提供了事件循环、协程、任务等功能。
    - 底层实现是基于生成器的协程，通过yield实现协程的挂起和恢复。
协程的启动
    - asyncio.run()：用于运行最高层级的入口协程，负责创建事件循环、执行协程、关闭事件循环等操作。是协程的生命周期的开始
挂起
    - await：用于挂起协程函数的执行，等待异步操作完成后再继续执行。是协程的生命周期的中间状态
调度与切换，只要协程闲置，资源就会被释放，其他协程就可以使用这些资源。协程的调度是由事件循环来完成的，事件循环会不断地检查是否有协程需要执行，如果有，就会将其加入到执行队列中，并按照一定的顺序执行这些协程。
恢复：在协程被挂起后，当异步操作完成时，事件循环会将其恢复执行，继续执行协程函数的剩余部分。
"""
import asyncio
import time

# 使用async定义一个协程
async def complex_task(delay: int) -> str:
    # 模拟一个复杂的计算任务
    time.sleep(delay)
    return f"任务完成，耗时: {delay}秒"

if __name__ == "__main__":
    # 创建一个事件循环
    loop = asyncio.get_event_loop()
    # 创建一个协程对象
    task = loop.create_task(complex_task(3))
    # 启动事件循环，等待协程完成
    loop.run_until_complete(task)
    print(task.result())